#选择工具语言:Selected=1(中文);Selected=2(英文)
[Language]
Kinds=2
Selected=1
LangPath=Language\

Lang1File=Chinese.ini
Lang1FontName=宋体
Lang1FontSize=9

Lang2File=English.ini
Lang2FontName=Arial
Lang2FontSize=9

[System]
#指定设备类型，可支持的设备类型如下：
#RK27_DEVICE=0x10
#RKCAYMAN_DEVICE=0x11
#RK28_DEVICE=0x20
#RK281X_DEVICE=0x21
#RKPANDA_DEVICE=0x22
#RKNANO_DEVICE=0x30
#RKCROWN_DEVICE=0x40
#RK29_DEVICE=0x50
#RK30_DEVICE=0x60

SUPPORT_DEVICE=

#指定设备在Msc状态下的VID和PID
MSC_VID=0x0BB4
MSC_PID=0x0C02

#是否扫描全速usb设备标志,1表示支持,其他为不支持
IS_SUPPORT_FULL_USB=1

#等待msc设备重新连接的超时时间,秒为单位
MSC_TIMEOUT=20

#等待rockusb设备重新连接的超时时间,秒为单位
ROCKUSB_TIMEOUT=20

#日志功能开关,1表示记录日志,其他值为不记录日志
IS_LOG_ON=1
#指定序列号大小写限制,LOWER只允许小写字符，UPPER只允许大写字符，其他值不限制
SN_CASE_CHECK=
#指定序列号前置固定字符串
SN_PREFIX_STRING=
#指定序列号长度,最大支持60个字符
SN_LENGTH=15
#指定序列号字符宽度,像素为单位
SN_CHAR_WIDTH=10
#当选择自动增长序列号时,不参与进位的前导字符串长度,为空时则没有前导固定字符串
SN_AUTO_PREFIX_LEN=
#当选择自动增长序列号时,不参与进位的后置字符串长度,为空时则没有后置固定字符串
SN_AUTO_SUFFIX_LEN=
#当选择人工模式时,是否要在写入成功后,自动清空输入的数据.值为1时开启此功能,其他值则关闭此功能
CLEAR_AFTER_WRITE=1
#写操作后,设备是否要重启.值为1时写操作完成后进行设备重启,其他值则不进行设备重启
RESET_AFTER_WRITE=1
#写操作后,设备是否要锁住.值为1时写操作完成后锁住设备,其他值则不进行锁设备
LOCK_AFTER_WRITE=
#以下七项是七个页面显示开关,值为1则显示,其他值则不显示
SN_PAGE=1
MAC_PAGE=1
WIFI_PAGE=1
BT_PAGE=1
IMEI_PAGE=1
ALL_PAGE=1
CUSTOM_PAGE=1
#设备处于锁状态下,需要指定证书才能烧写,指定证书存放路径
UNLOCK_CERT=
